Revit 2027 API
ParameterTypeId.StairsAttrNosingPlacement Property
 "Apply Nosing Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrNosingPlacement { get; }
Public Shared ReadOnly Property StairsAttrNosingPlacement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrNosingPlacement {
	ForgeTypeId^ get ();
}
static member StairsAttrNosingPlacement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace